TEMPLATE = {
    "target": "{시도명} {시군구명} {도로명} {건물본번1}-{건물부번} ({행정동명})",
    "noised": [
        "{시도명} {시군구명} {도로명} {건물본번2}-{건물부번} ({행정동명})",
        "{도로명} {건물본번2}-{건물부번} {시도명} {시군구명}",
        "{건물본번2}-{건물부번} {도로명} {시군구명} {시도명}",
        "{시군구명} {건물본번2}-{건물부번} {도로명}",
        "{시도명} {건물본번2}-{건물부번} {도로명} {시군구명} {시도명}",
        "{건물본번2}-{건물부번} {도로명} {시군구명} {시도명}",
        "{시도명} {건물본번2}-{건물부번} {도로명} {시군구명} {시도명}",
        "{지하여부} {건물본번2}-{건물부번} {도로명} {시도명} ({행정동명})",
        "{지하여부} {건물본번2}-{건물부번} {도로명} {시군구명} {시도명} ({행정동명})",
        "{지하여부} {건물본번2}-{건물부번} {시군구명} {시도명}",
        "{건물본번2}-{건물부번} {지하여부} {도로명} {시군구명} {시도명}",
        "{건물본번2}-{건물부번} {지하여부} {시군구명} {시도명}",
        "{도로명} {건물본번2}-{건물부번} {지하여부} {시군구명} {시도명} ({행정동명})",
        "{시도명} {시군구명} {지하여부} {건물본번2}-{건물부번} ({행정동명})",
        "{시도명} ({행정동명}) {시군구명} {도로명} {건물본번2}-{건물부번}"
    ]
}

ENTITY_MATCH = {
    "{시도명}": "{영문시도명}",
    "{시군구명}": "{영문시군구명}",
    "{도로명}": "{영문도로명}"
}

# 테스트 데이터 활용
EXTRA_WORDS = [
    "문 앞에 놔주세요",
    "노크 x",
    "Republic of Korea",
    "아이가 자고 있어요.",
    "김&장",
    "1001ho1001동",
    "Suyeong Tax Office Building파란건물",
    "Suseo Police Station",
    "MUN AP",
    "100% office",
    "지하&상가",
    "100%",
    "이음&",
    "*^^*",
    "^",
    "$달러샵$",
    "@KIM",
    "100% OFFICE",
    "customs office 100%",
    "A동",
    "100,1001 김&장 customer office",
    "문앞"	
]



SEP_TOKENS = [
    " ",
    ", ",
    ",",
    "-"
]

UNDERGROUND =  [
    "B",
    "B,",
    "B, "
    "underground in ",
    "G/F",
    "G/F,"
    "g/f, "
]